Repository: qhta/MyLib
Catalog: Qhta.Unicode/Qhta.UnicodeBuild/Resources/Strings.*.resx
Languages: pl

source: Edit
pl: Edycja

# UcdBlocks
source: Unicode Blocks
pl: Bloki Unicode

# UcdRanges
source: Unicode ranges
pl: Zakresy Unicode

source: Writing Systems
pl: Systemy pisma

source: Cut
pl: Wytnij

source: Copy
pl: Kopiuj

source: Paste
pl: Wklej

source: Help
pl: Pomoc

source: About
pl: O programie

source: New Writing System
pl: Nowy system pisma

source: Description
pl: Opis

# WritingSystemsTooltip
source: A writing system comprises a set of symbols, called a script, as well as the rules by which the script represents a particular language.
pl: System pisma składa się ze zbioru symboli, nazywanego pismem, a także z reguł, według których pismo reprezentuje dany język.

# UcdBlocksTooltip
source: A Unicode block is one of contiguous ranges of numeric character codes (code points) of the Unicode character set that are defined by the Unicode Consortium for administrative and documentation purposes. One Unicode blocks can contain one or many Unicode ranges, which can be shown under each block.
pl: Blok Unicode to jeden z ciągłych zakresów numerycznych kodów znaków (punktów kodowych) zestawu znaków Unicode, które są definiowane przez Konsorcjum Unicode w celach administracyjnych i dokumentacyjnych. Jeden blok Unicode może zawierać jeden lub wiele zakresów Unicode, które mogą być przeglądane pod każdym blokiem.

# UcdRangesTooltip
source: A Unicode range is a contiguous range of numeric character codes (code points) of the Unicode character set that have the specific rules of use and translation. These rules are specified by writing systems. One Unicode range can contain one or many Unicode code points. The "Unicode Ranges" tab contains a full list of ranges.
pl: Zakres Unicode to jeden z ciągłych zakresów numerycznych kodów znaków (punktów kodowych) zestawu znaków Unicode, dla których obowiązują określone zasady użytkowania i tłumaczenia. Reguły te są określone przez systemy pisma. Jeden zakres Unicode może zawierać jeden lub wiele punktów kodowych Unicode. Zakładka "Zakresy Unicode" zawiera pełną listę zakresów.

source: Comment
pl: Komentarz

source: Code Points
pl: Punkty kodowe

# CodePointsTooltip
source: In Unicode, a code point is a unique numerical value assigned to each character within the Unicode standard. These code points range from U+0000 to U+10FFFF, forming the Unicode codespace.
pl: W Unicode punkt kodowy to unikalna wartość liczbowa przypisana do każdego znaku w standardzie Unicode. Te punkty kodowe mieszczą się w zakresie od U+0000 do U+10FFFF i tworzą przestrzeń kodową Unicode.

source: Cannot be empty
pl: Nie może być pusta

source: New
pl: Nowy

source: Properties
pl: Właściwości

source: Cancel
pl: Anuluj

source: Operation cancelled
pl: Operację przerwano

source: Error
pl: Błąd

# ErrorOcurred
source: An error occurred: {0}
pl: Wystąpił błąd: {0}

# OperationCompleted
source: Operation completed successfully.
pl: Operację zakończono pomyślnie.

# FileNotFound
source: File not found: {0}
pl: Nie znaleziono pliku {0}

# ErrorInLine
source: Error in line{0}
pl: Błąd w linii {0}

# Loading
source: Loading {0}
pl: Ładowanie {0}

# WritingSystemNotFound
source: Writing System {0} not found
pl: Nie znaleziono systemu pisma {0}

# EmptyItem
source: (Empty)
pl: (Puste)

# UnsavedDataChanges
source: There are unsaved data changes. Do you want to save them in the data base?
pl: Pewne zmiany danych nie zostały zapamiętane. Czy chcesz je zachować w bazie danych?

source: Warning
pl: Ostrzeżenie

source: Fill column
pl: Wypełnij kolumnę

# FillColumnTooltip
source: Fill column with selected value
pl: Wypełnij kolumnę wybraną wartością

source: Select value
pl: Wybierz wartość

# FillColumnTitle
source: Fill column {0}
pl: Wypełnij kolumnę {0}

# SelectValueTitle
source: Select "{0}"
pl: Wybierz "{0}"

# EmptyCellsOnly
source: Fill empty cells only
pl: Wypełniaj tylko puste komórki

# NonEmptyItem
source: (Not empty)
pl: (Nie puste)

source: Data
pl: Dane

# SaveData
source: Save data (Ctrl-S)
pl: Zapisz dane (Ctrl-S)

source: Tools
pl: Narzędzia

source: Save
pl: Zapisz

source: Too long value
pl: Za długa wartość

# InvalidCodePointFormat
source: Invalid code point format: {0}. Hexadecimal value expected.
pl: Błędny format punktu kodowego {0}. Oczekiwana wartość szesnastkowa.

# InvalidCodeRangeFormat
source: Invalid code range format: {0}. Two hexadecimal value expected separated with two dots. A single value is allowed.
pl: Błędny format zakresu kodowego: {0}. Oczekiwane dwie wartości szesnastkowe oddzielone dwiema kropkami. Może być tylko jedna wartość.

# EndValueMustBeGreater
source: End value must be greater than or equal to start value.
pl: Wartość końcowa musi być większa lub równa wartości początkowej.

# CannotDeleteWritingSystem
source: Cannot delete writing system as it is used in other entities.
pl: Nie można usunąć systemu pisma, gdyż jest używany w innych encjach.

# ApplyCharNamesGenerationConfirm
source: Do you really want to generate char names for {0} code points? (Existing names will not be overwritten.)
pl: Czy na pewno chcesz generować nazwy znaków dla {0} punktów kodowych? (Istniejące nazwy nie zostaną nadpisane.)

source: Confirm
pl: Potwierdź

source: No code points selected.
pl: Nie wybrano punktów kodowych.

# AmbiguousWritingSystemCategoryOrPhrase
source: Writing system {0} has not unique (category, phrase) key.
pl: System pisma {0} ma powtarzalny klucz (kategoria, fraza).

# CodePointCategoryIsNull
source: Code point {0} category is empty.
pl: Kategoria punktu kodowego {0} jest pusta.

# CodePointDescriptionIsNull
source: Code point {0} description is empty.
pl: Nazwa opisowa punktu kodowego {0} jest pusta.

source: Apply block mapping
pl: Zastosuj mapowanie bloków

# ApplyBlockMappingConfirm
source: Do you really want to apply block mapping from block ranges? (All current "block" fields w be updated.)
pl: Czy na pewno chcesz zastosować mapowanie bloków na podstawie ich reguł? (Jeśli tak, to wszystkie pola "blok" zostaną zaktualizowane.)

# ApplyBlockMappingTooltip
source: Apply code point mapping to Unicode blocks by checking block ranges.
pl: Zastosuj mapowanie punktów kodowych do bloków Unicode przez sprawdzenie zakresów bloków.

# ApplyWritingSystemsMappingFromFile
source: Apply writing systems mapping
pl: Zastosuj mapowanie z pliku

# ApplyWritingSystemsMappingFromFileTooltip
source: Apply code point mapping to scripts from a text file. The first column in a line should contain the character code or code range, the second column should contain the name of the script. The columns should be separated by tabs. The '#' character is treated as the first character of a comment that extends to the end of the line.
pl: Zastosuj mapowanie punktów kodowych do systemów pisma z pliku tekstowego. W pierwszej kolumnie w linii powinien być zapisany kod znaku lub zakres kodowy, w drugiej - nazwa systemu pisma. Kolumny powinny być oddzielone znakami tabulacji. Znak '#' jest traktowany jako pierwszy znak komentarza, który rozciąga się do końca linii.

# ApplyWritingSystemsRecognition
source: Apply writing system recognition
pl: Zastosuj rozpoznawanie systemów pisma

# ApplyWritingSystemsRecognitionTooltip
source: Apply code point mapping to writing systems based on category and key phrase.
pl: Zastosuj mapowanie punktów kodowych do systemów pisma na podstawie kategorii i fraz kluczowych.

# AmbiguousWritingSystemCategory
source: Writing system {0} has not unique category key.
pl: System pisma {0} ma powtarzalny klucz kategorii.

# AmbiguousWritingSystemPhrase
source: Writing system {0} has not unique phrase key.
pl: System pisma {0} ma powtarzalny klucz frazy.

# ApplyWritingSystemsRecognitionAdvice
source: Try selecting specific columns to recognize writing systems of certain types.
pl: Spróbuj wybrać określone kolumny, aby rozpoznać systemy pisma określonych typów.

# ApplyWritingSystemsRecognitionCompleted
source: Writing system recognition completed. {0} code points mapped.
pl: Zakończono rozpoznawanie systemów pisma. Zmapowano {0} punktów kodowych.

# InvalidWritingSystemCategory
source: Invalid category '{0}' in writing system {1}.
pl: Nieprawidłowa kategoria {0} w systemie pisma {1}.

source: Apply char names generation
pl: Zastosuj generowanie nazw znaków

# ApplyWritingSystemsRecognitionConfirm
source: Do you really want to recognize writing systems for {0} code points? (Existing mapping will not be overwritten.)
pl: Czy na pewno chcesz rozpoznać systemy pisma dla {0} punktów kodowych? (Istniejące odwzorowania nie zostaną nadpisane.)

# ApplyCharNamesGenerationTooltip
source: Apply code point char names generation based on writing systems mapping.
pl: Zastosuj generowanie nazw znaków dla punktów kodowych na podstawie mapowania do systemów pisma.

# ApplyCharNamesGenerationCompleted
source: Char names generation completed. {0} code points named.
pl: Zakończono generowanie nazw znaków dla punktów kodowych. Nazwano {0} punktów kodowych.

# MarkUnusedWritingSystems
source: Mark unused writing system
pl: Zaznacz nieużywane systemy pisma

# MarkUnusedWritingSystemsTooltip
source: Select writing systems that are not used by any Unicode block or code point and has no children.
pl: Zaznacz systemy pisma, który nie są używane przez żaden blok Unicode ani żaden punkt kodowy i nie mają żadnych dzieci.

# NameGenOptions
source: Name generator options
pl: Opcje generowania nazw

source: Predefined names file
pl: Plik z predefiniowanymi nazwami

# PredefinedNamesFileSelection
source: Select file with predefined names
pl: Wybierz plik z predefiniowanymi nazwami

# CsvFilesFilter
source: CSV Files (*.csv)|*.csv|Text Files (*.txt)|*.txt|All Files (*.*)|*.*
pl: Pliki CSV(*.csv)|*.csv|Pliki tekstowe (*.txt)|*.txt|Wszystkie pliki (*.*)|*.*

# TextFilesFilter
source: Text Files (*.txt)|*.txt|All Files (*.*)|*.*
pl: Pliki tekstowe (*.txt)|*.txt|Wszystkie pliki (*.*)|*.*

# Numeric
source: Numeric words are converted to numbers
pl: Słowa numeryczne są konwertowane na liczby.

source: Known numerals file
pl: Plik ze znanymi liczebnikami

# KnownNumeralsFileTooltip
source: File with known numerals contains two-column mapping. First column contains words or multiword phrases. Second column contains their values.
pl: Plik ze znanymi liczebnikami zawiera dwukolumnowe mapowanie. Pierwsza kolumna zawiera słowa lub frazy wielowyrazowe. Druga kolumna zawiera ich wartości.

# KnownNumeralsFileSelection
source: Select file with known numerals
pl: Wybierz plik ze znanymi liczebnikami
