Repository: qhta/MyLib
Catalog: Qhta.Unicode/Qhta.UnicodeBuild/Resources/WritingSystemKind.*.resx
Languages: pl

source: Abjad
pl: Spółgłoskowe

source: Abugida
pl: Alfabet sylabiczny

source: Alphabet
pl: Alfabet

source: Constructed
pl: Sztuczne

source: Control
pl: Kontrolny

source: Cuneiform
pl: Klinowe

source: Encoding
pl: Kodujący

source: Form
pl: Forma

source: Graphical
pl: Graficzny

source: Hieroglyphic
pl: Hieroglificzne

source: Ideographic
pl: Ideograficzne

source: Invisible
pl: Niewidoczne

source: Logographic
pl: Logograficzne

source: Mixed
pl: Mieszane

source: Musical
pl: Muzyczna

source: Phonetic
pl: Fonetyczna

source: Pictographic
pl: Piktograficzne

source: Semi-syllabary
pl: Półsylabariusz

source: Stenography
pl: Stenografia

source: Syllabary
pl: Sylabariusz

source: Symbolic
pl: Symboliczny

# AbjadTooltip
source: A writing system in which only consonants are represented, leaving the vowel sounds to be inferred by the reader.
pl: System pisma, w którym reprezentowane są tylko spółgłoski, pozostawiający dźwięki samogłosek do wywnioskowania przez czytelnika.

# AbugidaTooltip
source: A segmental writing system in which consonant–vowel sequences are written as units; each unit is based on a consonant letter, and vowel notation is secondary, similar to a diacritical mark.
pl: Segmentowy system pisma, w którym sekwencje spółgłoska-samogłoska są zapisywane jako jednostki; każda jednostka opiera się na literze spółgłoski, a notacja samogłosek jest drugorzędna, podobnie jak znak diakrytyczny.

# AlphabetTooltip
source: A standard set of letters written to represent particular sounds in a spoken language.
pl: Standardowy zestaw liter zapisywanych w celu reprezentowania określonych dźwięków w języku mówionym.

# ConstructedTooltip
source: A language whose phonology, grammar, orthography, and vocabulary, instead of having developed naturally, are consciously devised for some purpose.
pl: Język, którego fonologia, gramatyka, ortografia i słownictwo nie rozwinęły się w sposób naturalny, ale są świadomie wymyślone w jakimś celu.

# ControlTooltip
source: A set of characters that control the flow of text,
pl: Zestaw znaków, które sterują przepływem tekstu,

# CuneiformTooltip
source: A logo-syllabic writing system that was used to write several languages of the Ancient Near East, named for the characteristic wedge-shaped impressions which form their signs.
pl: Logo-sylabiczny system pisma, który był używany do zapisu kilku języków starożytnego Bliskiego Wschodu, nazwany tak od charakterystycznych odcisków w kształcie klina, które tworzą ich znaki.

# EncodingTooltip
source: A set of characters encoding other characters.
pl: Zestaw znaków kodujących inne znaki.

# FormTooltip
source: A set of characters with a special presentation form.
pl: Zestaw znaków ze specjalną formą prezentacji.

# GraphicalTooltip
source: A set of graphical shapes for individual use or used to construct drawings.
pl: Zestaw kształtów graficznych do użytku indywidualnego lub służących do konstruowania rysunków.

# HieroglyphicTooltip
source: An ancient writing system that combines ideographic, logographic, syllabic and alphabetic elements.
pl: Starożytny system pisma, który łączy w sobie elementy ideograficzne, logograficzne, sylabiczne i alfabetyczne.

# IdeographicTooltip
source: A writing system consisting of symbols that represents ideas or concepts independent of any particular language.
pl: System pisma składający się z symboli, który reprezentuje idee lub koncepcje niezależne od konkretnego języka.

# InvisibleTooltip
source: A set of code points that have no visible presentations.
pl: Zestaw punktów kodowych, które nie mają widocznych prezentacji.

# LogographicTooltip
source: A set of written characters that represent semantic components of a language, such as words or morphemes.
pl: Zestaw znaków pisanych, które reprezentują semantyczne składniki języka, takie jak słowa lub morfemy.

# MixedTooltip
source: Mixed logographic, syllabary and phonetic writing system.
pl: Mieszany system pisma logograficznego, sylabicznego i fonetycznego.

# MusicalTooltip
source: A writing system used to visually represent music.
pl: System pisma używany do wizualnego przedstawiania muzyki.

# PhoneticTooltip
source: A set of symbols used in phonetic notation.
pl: Zestaw symboli używanych w notacji fonetycznej.

# PictographicTooltip
source: A set of graphical symbols that convey meaning through its visual resemblance to physical objects.
pl: Zestaw symboli graficznych, które przekazują znaczenie poprzez wizualne podobieństwo do obiektów fizycznych.

# SemiSyllabaryTooltip
source: A writing system that behaves partly as an alphabet and partly as a syllabary.
pl: System pisma, który zachowuje się częściowo jak alfabet, a częściowo jak sylabariusz.

# StenographyTooltip
source: An abbreviated symbolic writing method that increases speed and brevity of writing as compared to longhand, a more common method of writing a language.
pl: Skrócona metoda pisania symbolicznego, która zwiększa szybkość i zwięzłość pisania w porównaniu z pełną, bardziej powszechną metodą pisania języka.

# SyllabaryTooltip
source: A set of written symbols that represent the syllables or (more frequently) morae which make up words.
pl: Zestaw symboli pisanych, które reprezentują sylaby lub (częściej) mory (jednostki fonologiczne), które składają się na słowa.

# SymbolicTooltip
source: A set of symbols from a certain domain.
pl: Zestaw symboli z określonej dziedziny.
